In [1]:
import pandas as pd

In [10]:
class OrdinalEncoder():
    def __init__(self):
        self.colsEncoding=pd.DataFrame({})
    def fit_transform(self,df):
        for i in df.select_dtypes(include=['object']).columns:
            n=0
            for j in df[i]:
                if j not in self.colsEncoding.index or pd.isna(self.colsEncoding.loc[j, i]):
                    self.colsEncoding.loc[j,i]=n
                    n+=1
        print(self.colsEncoding)
        return self.transform(df)
    
    def transform(self,df_in):
        df=df_in.copy()
        for i in df.select_dtypes(include=['object']).columns:
            for j in range(len(df[i])):
                df.loc[j,i]=self.colsEncoding.loc[df[i][j],i]
        return df

In [11]:
oc=OrdinalEncoder()

In [12]:
data=pd.read_csv('data.csv')

In [13]:
oc.fit_transform(data)

         Country  Purchased
France       0.0        NaN
Spain        1.0        NaN
Germany      2.0        NaN
India        3.0        NaN
No           NaN        0.0
Yes          NaN        1.0

    Age   Salary Country Purchased
0  25.0  50000.0     0.0       0.0
1  30.0  54000.0     1.0       1.0
2   NaN  61000.0     2.0       0.0
3  38.0      NaN     1.0       0.0
4  40.0      NaN     2.0       1.0
5  35.0  58000.0     0.0       1.0
6   NaN  52000.0     3.0       1.0
7  48.0  79000.0     0.0       1.0